_Rarzrabotki/Rarus/USO2/Catalogs/уатУчетныеЗаписиСистемыМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>уатУчетныеЗаписиСистемыМониторинга</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Comment>Система мониторинга (уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСистемаGPS</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Comment>Адрес сервиса системы мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Comment>Логин в системе мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль в системе мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Comment>Токен авторизации в системе мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Имя сервера базы данных (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСистемы</Name>
					<Comment>Вид системы (уат)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаботы</Name>
					<Comment>Способ работы (уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРаботыСOmnicomm</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПодключения</Name>
					<Comment>Способ подключения (уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособПодключенияКOmnicomm</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБД</Name>
					<Comment>Имя базы данных (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Драйвер</Name>
					<Comment>Название драйвера ODBC (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяPIPE</Name>
					<Comment>Имя PIPE (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяDSN</Name>
					<Comment>Имя DSN (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Comment>Имя ресурса (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСистемаGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСистемаGPS</Name>
			<Comment>Cистема мониторинга (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1СЦСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dynafleet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wialon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоГРАФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автотрекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКАУТ</Name>
					<Comment>СКАУТ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/уатУчетныеЗаписиСистемыМониторинга/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.Dynafleet.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга 				 = Перечисления.уатСистемаGPS.Dynafleet;
	СпрОбъект.АдресСервиса						 = Константы.уатАдресСервисаDynafleet.Получить();
	СпрОбъект.Логин								 = Константы.уатЛогинВСистемеDynafleet.Получить();
	СпрОбъект.Пароль							 = Константы.уатПарольВСистемеDynafleet.Получить();
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.Omnicomm.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Перечисления.уатСистемаGPS.Omnicomm;
	СпрОбъект.АдресСервиса						 = Константы.уатАдресСервисаOmnicomm.Получить();
	СпрОбъект.ИмяDSN				 = Константы.уатИмяDSNСистемеOmnicomm.Получить();
	СпрОбъект.ИмяPIPE			 = Константы.уатИмяPIPEСистемеOmnicomm.Получить();
	СпрОбъект.ИмяБД				 = Константы.уатИмяБДВСистемеOmnicomm.Получить();
	СпрОбъект.Логин								 = Константы.уатЛогинВСистемеOmnicomm.Получить();
	СпрОбъект.Пароль							 = Константы.уатПарольВСистемеOmnicomm.Получить();
	СпрОбъект.Сервер			 = Константы.уатСерверВСистемеOmnicomm.Получить();
	СпрОбъект.СпособПодключения	 = Константы.уатСпособПодключенияКСистемеOmnicomm.Получить();
	СпрОбъект.СпособРаботы				 = Константы.уатСпособРаботыСOmnicomm.Получить();
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.Wialon.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Перечисления.уатСистемаGPS.Wialon;
	СпрОбъект.АдресСервиса						 = Константы.уатАдресСервисаWialon.Получить();
	СпрОбъект.ТокенАвторизации					 = Константы.уатТокенВСистемеWialon.Получить();

	ПараметрыWialon = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхWialon.Получить().Получить();
	Если ПараметрыWialon = Неопределено Тогда 
		ПараметрыWialon = Новый Структура;
	КонецЕсли;
	Если Не ПараметрыWialon.Свойство("Ресурс") Тогда
		ПараметрыWialon.Вставить("Ресурс", "");
	КонецЕсли;
	Если Не ПараметрыWialon.Свойство("ВидСистемы") Тогда
		ПараметрыWialon.Вставить("ВидСистемы", 0);
	КонецЕсли;
	СпрОбъект.Ресурс		 = ПараметрыWialon.Ресурс;
	СпрОбъект.ВидСистемы	 = ПараметрыWialon.ВидСистемы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.АвтоГРАФ.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Перечисления.уатСистемаGPS.АвтоГРАФ;
	СпрОбъект.АдресСервиса						 = Константы.уатАдресСервисаАвтоГРАФ.Получить();
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.СКАУТ.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Перечисления.уатСистемаGPS.СКАУТ;
	СпрОбъект.АдресСервиса						 = Константы.уатАдресСервисаСКАУТ.Получить();
	СпрОбъект.Логин								 = Константы.уатЛогинВСистемеСКАУТ.Получить();
	СпрОбъект.Пароль							 = Константы.уатПарольВСистемеСКАУТ.Получить();
	СпрОбъект.Записать();
	
	МассивПСМ = Новый Массив();
	уатРаботаСРасширениями.ПСМ_ЗаполнитьМассивПСМ(МассивПСМ);
	Если МассивПСМ.Количество() > 0 Тогда
		уатРаботаСРасширениями.ПСМ_ЗаполнитьУчетнуюЗаписьСистемыМониторинга(МассивПСМ[0]);
	Иначе
		СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.ПСМ.ПолучитьОбъект();
		СпрОбъект.СистемаМониторинга = "";
		СпрОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
